Tekla Open API Reference for Tekla Structures 2025
Integer.Equality Operator
 Compares an int value with a Datatype.Integer value.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator ==(
	int Left,
	Integer Right
)
Public Shared Operator = (
	Left As Integer,
	Right As Integer
) As Boolean
Parameters
Left
Type: System.Int32
The int value to be compared.
Right
Type: Tekla.Structures.Datatype.Integer
The Datatype.Integer value to be compared.
Return Value
Type: Boolean
True if the values are the same.
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace